   #!/bin/bash
   # هذا السكربت يحسب الفائدة البسيطة بناءً على المبلغ الرئيسي،
   # معدل الفائدة السنوي ومدة الوقت بالسنوات.

   # لا تستخدم هذا في الإنتاج. لأغراض عينة فقط.

   # المؤلف: أبكار ليدر (IBM)
   # مؤلفون إضافيون:
   # <اسم مستخدم GitHub الخاص بك>

   # المدخلات:
   # p، المبلغ الرئيسي
   # t، مدة الوقت بالسنوات
   # r، معدل الفائدة السنوي

   # المخرجات:
   # الفائدة البسيطة = p*t*r

   echo "أدخل المبلغ الرئيسي:"
   read p
   echo "أدخل مدة الوقت بالسنوات:"
   read t
   echo "أدخل معدل الفائدة لكل سنة:"
   read r

   s=$(echo "scale=2; $p * $t * $r / 100" | bc)
   echo "الفائدة البسيطة هي: "
   echo $s
